10×10の文字列を出力    
<?php
    for ($i = 1; $i <= 100; $i++) {
        if ($i % 10 == 0) {
            echo '笹' .'<br>'; 
        } else {
            echo '笹' . ' ';
        }
    }

//  回答例1
// for($b=0; $b<10; $b++){
//   for($a=0; $a<10; $a++){
//     echo '笹';
//   }
//   echo '<br>';
// }

// 回答例２
// PHP 10行
// for($i=1 ; $i<=100 ; $i++){
//   echo "笹";
//   if($i % 10 == 0){
//       echo '<br>';
//   }
// }

// 回答例
// PHP 連続出力
// $a = "笹";
//   for ($i = 1; $i <= 10 ; $i++) {
//       echo str_repeat($a, 10)  . '<br>';
//   }



